great-houk/redshift-test/LPC55S28_PAC/LPC55S28.svd
              </enumeratedValues>
            </field>
            <field>
              <name>INTS24</name>
              <description>Interrupt Targets Non-secure bits.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SECURE_STATE</name>
                  <description>The interrupt targets Secure state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NON_SECURE_STATE</name>
                  <description>The interrupt targets Non-secure state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTS25</name>
              <description>Interrupt Targets Non-secure bits.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SECURE_STATE</name>
                  <description>The interrupt targets Secure state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NON_SECURE_STATE</name>
                  <description>The interrupt targets Non-secure state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTS26</name>
              <description>Interrupt Targets Non-secure bits.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SECURE_STATE</name>
                  <description>The interrupt targets Secure state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NON_SECURE_STATE</name>
                  <description>The interrupt targets Non-secure state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTS27</name>
              <description>Interrupt Targets Non-secure bits.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SECURE_STATE</name>
                  <description>The interrupt targets Secure state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NON_SECURE_STATE</name>
                  <description>The interrupt targets Non-secure state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTS28</name>
              <description>Interrupt Targets Non-secure bits.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SECURE_STATE</name>
                  <description>The interrupt targets Secure state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NON_SECURE_STATE</name>
                  <description>The interrupt targets Non-secure state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTS29</name>
              <description>Interrupt Targets Non-secure bits.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SECURE_STATE</name>
                  <description>The interrupt targets Secure state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NON_SECURE_STATE</name>
                  <description>The interrupt targets Non-secure state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTS30</name>
              <description>Interrupt Targets Non-secure bits.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SECURE_STATE</name>
                  <description>The interrupt targets Secure state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NON_SECURE_STATE</name>
                  <description>The interrupt targets Non-secure state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTS31</name>
              <description>Interrupt Targets Non-secure bits.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SECURE_STATE</name>
                  <description>The interrupt targets Secure state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NON_SECURE_STATE</name>
                  <description>The interrupt targets Non-secure state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>120</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>IPR[%s]</name>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PRI_0</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_1</name>
              <description>no description available</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_2</name>
              <description>no description available</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_3</name>
              <description>no description available</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIR</name>
          <description>Software Trigger Interrupt Register</description>
          <addressOffset>0xE00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INTID</name>
              <description>Interrupt ID of the interrupt to trigger, in the range 0-479.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
